jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SPI_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.57
// Version: 1

#ifndef __SI32_SPI_A_REGISTERS_H__
#define __SI32_SPI_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_SPI_A_DATA_Struct
{
   union
   {
      // This is a FIFO register
      volatile uint8_t  U8;
      volatile uint16_t U16;
      volatile uint32_t U32;
   };
};

#define SI32_SPI_A_DATA_DATA_MASK  0xFFFFFFFF
#define SI32_SPI_A_DATA_DATA_SHIFT  0



struct SI32_SPI_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Receive FIFO Read Request Interrupt Flag
         volatile uint32_t RFRQI: 1;
         // Receive FIFO Overrun Interrupt Flag
         volatile uint32_t RFORI: 1;
         // Transmit FIFO Write Request Interrupt Flag
         volatile uint32_t TFRQI: 1;
         // Transmit FIFO Overrun Interrupt Flag
         volatile uint32_t TFORI: 1;
         // Slave Selected Interrupt Flag
         volatile uint32_t SLVSELI: 1;
         // Mode Fault Interrupt Flag
         volatile uint32_t MDFI: 1;
         // Underrun Interrupt Flag
         volatile uint32_t URI: 1;
         // Shift Register Empty Interrupt Flag
         volatile uint32_t SREI: 1;
         // Illegal Receive FIFO Access Interrupt Flag
         volatile uint32_t RFILI: 1;
         // Illegal Transmit FIFO Access Interrupt Flag
         volatile uint32_t TFILI: 1;
                  uint32_t reserved0: 4;
         // NSS Instantaneous Pin Status
         volatile uint32_t NSSSTS: 1;
         // SPI Busy
         volatile uint32_t BUSYF: 1;
         // Receive FIFO Counter
         volatile uint32_t RFCNT: 4;
         // Transmit FIFO Counter
         volatile uint32_t TFCNT: 4;
         // SPI Debug Mode
         volatile uint32_t DBGMD: 1;
                  uint32_t reserved1: 7;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SPI_A_CONTROL_RFRQI_MASK  0x00000001
#define SI32_SPI_A_CONTROL_RFRQI_SHIFT  0
// The RX FIFO has fewer bytes than the level defined by RFTH.
#define SI32_SPI_A_CONTROL_RFRQI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_RFRQI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_RFRQI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_RFRQI_SHIFT)
// The RX FIFO has equal or more bytes than the level defined by RFTH.
#define SI32_SPI_A_CONTROL_RFRQI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_RFRQI_SET_U32 \
   (SI32_SPI_A_CONTROL_RFRQI_SET_VALUE << SI32_SPI_A_CONTROL_RFRQI_SHIFT)

#define SI32_SPI_A_CONTROL_RFORI_MASK  0x00000002
#define SI32_SPI_A_CONTROL_RFORI_SHIFT  1
// Read: A receive FIFO overrun has not occurred. Write: Clear the flag.
#define SI32_SPI_A_CONTROL_RFORI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_RFORI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_RFORI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_RFORI_SHIFT)
// Read: A receive FIFO overrun  occurred. Write: Force a receive overrun
// interrupt.
#define SI32_SPI_A_CONTROL_RFORI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_RFORI_SET_U32 \
   (SI32_SPI_A_CONTROL_RFORI_SET_VALUE << SI32_SPI_A_CONTROL_RFORI_SHIFT)

#define SI32_SPI_A_CONTROL_TFRQI_MASK  0x00000004
#define SI32_SPI_A_CONTROL_TFRQI_SHIFT  2
// The TX FIFO has fewer bytes than the level defined by TFTH.
#define SI32_SPI_A_CONTROL_TFRQI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_TFRQI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_TFRQI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_TFRQI_SHIFT)
// The TX FIFO has equal or more bytes than the level defined by TFTH.
#define SI32_SPI_A_CONTROL_TFRQI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_TFRQI_SET_U32 \
   (SI32_SPI_A_CONTROL_TFRQI_SET_VALUE << SI32_SPI_A_CONTROL_TFRQI_SHIFT)

#define SI32_SPI_A_CONTROL_TFORI_MASK  0x00000008
#define SI32_SPI_A_CONTROL_TFORI_SHIFT  3
// Read: A transmit FIFO overrun has not occurred. Write: Clear the flag.
#define SI32_SPI_A_CONTROL_TFORI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_TFORI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_TFORI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_TFORI_SHIFT)
// Read: A transmit FIFO overrun  occurred. Write: Force a transmit overrun
// interrupt.
#define SI32_SPI_A_CONTROL_TFORI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_TFORI_SET_U32 \
   (SI32_SPI_A_CONTROL_TFORI_SET_VALUE << SI32_SPI_A_CONTROL_TFORI_SHIFT)

#define SI32_SPI_A_CONTROL_SLVSELI_MASK  0x00000010
#define SI32_SPI_A_CONTROL_SLVSELI_SHIFT  4
// The slave select signal (NSS) is not active.
#define SI32_SPI_A_CONTROL_SLVSELI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_SLVSELI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_SLVSELI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_SLVSELI_SHIFT)
// The slave select signal (NSS) is active.
#define SI32_SPI_A_CONTROL_SLVSELI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_SLVSELI_SET_U32 \
   (SI32_SPI_A_CONTROL_SLVSELI_SET_VALUE << SI32_SPI_A_CONTROL_SLVSELI_SHIFT)

#define SI32_SPI_A_CONTROL_MDFI_MASK  0x00000020
#define SI32_SPI_A_CONTROL_MDFI_SHIFT  5
// Read: A master mode collision is not detected. Write: Clear the flag.
#define SI32_SPI_A_CONTROL_MDFI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_MDFI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_MDFI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_MDFI_SHIFT)
// Read: A master mode collision occurred. Write: Force a mode fault interrupt.
#define SI32_SPI_A_CONTROL_MDFI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_MDFI_SET_U32 \
   (SI32_SPI_A_CONTROL_MDFI_SET_VALUE << SI32_SPI_A_CONTROL_MDFI_SHIFT)

#define SI32_SPI_A_CONTROL_URI_MASK  0x00000040
#define SI32_SPI_A_CONTROL_URI_SHIFT  6
// Read: A data transfer is still in progress. Write: Clear the flag.
#define SI32_SPI_A_CONTROL_URI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_URI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_URI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_URI_SHIFT)
// Read: The transmit FIFO and shift register are empty and the data transfer has
// ended. Write: Force an underrun interrupt.
#define SI32_SPI_A_CONTROL_URI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_URI_SET_U32 \
   (SI32_SPI_A_CONTROL_URI_SET_VALUE << SI32_SPI_A_CONTROL_URI_SHIFT)

