jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SPI_A_Registers.h
#define SI32_SPI_A_CONTROL_SREI_MASK  0x00000080
#define SI32_SPI_A_CONTROL_SREI_SHIFT  7
// There is data still present in the transmit FIFO.
#define SI32_SPI_A_CONTROL_SREI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_SREI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_SREI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_SREI_SHIFT)
// All data has been transferred out of the shift register and there is no data
// waiting in the transmit FIFO.
#define SI32_SPI_A_CONTROL_SREI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_SREI_SET_U32 \
   (SI32_SPI_A_CONTROL_SREI_SET_VALUE << SI32_SPI_A_CONTROL_SREI_SHIFT)

#define SI32_SPI_A_CONTROL_RFILI_MASK  0x00000100
#define SI32_SPI_A_CONTROL_RFILI_SHIFT  8
// Read: An illegal write or read of the receive FIFO has not occurred. Write:
// Clear the flag.
#define SI32_SPI_A_CONTROL_RFILI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_RFILI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_RFILI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_RFILI_SHIFT)
// Read: An illegal write or read of the receive FIFO occurred. Write: Force an
// illegal receive access interrupt.
#define SI32_SPI_A_CONTROL_RFILI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_RFILI_SET_U32 \
   (SI32_SPI_A_CONTROL_RFILI_SET_VALUE << SI32_SPI_A_CONTROL_RFILI_SHIFT)

#define SI32_SPI_A_CONTROL_TFILI_MASK  0x00000200
#define SI32_SPI_A_CONTROL_TFILI_SHIFT  9
// Read: An illegal write or read of the transmit FIFO has not occurred. Write:
// Clear the flag.
#define SI32_SPI_A_CONTROL_TFILI_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_TFILI_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_TFILI_NOT_SET_VALUE << SI32_SPI_A_CONTROL_TFILI_SHIFT)
// Read: An illegal write or read of the transmit FIFO occurred. Write: Force an
// illegal transmit access interrupt.
#define SI32_SPI_A_CONTROL_TFILI_SET_VALUE  1
#define SI32_SPI_A_CONTROL_TFILI_SET_U32 \
   (SI32_SPI_A_CONTROL_TFILI_SET_VALUE << SI32_SPI_A_CONTROL_TFILI_SHIFT)

#define SI32_SPI_A_CONTROL_NSSSTS_MASK  0x00004000
#define SI32_SPI_A_CONTROL_NSSSTS_SHIFT  14
// NSS is currently a logic low.
#define SI32_SPI_A_CONTROL_NSSSTS_LOW_VALUE  0
#define SI32_SPI_A_CONTROL_NSSSTS_LOW_U32 \
   (SI32_SPI_A_CONTROL_NSSSTS_LOW_VALUE << SI32_SPI_A_CONTROL_NSSSTS_SHIFT)
// NSS is currently a logic high.
#define SI32_SPI_A_CONTROL_NSSSTS_HIGH_VALUE  1
#define SI32_SPI_A_CONTROL_NSSSTS_HIGH_U32 \
   (SI32_SPI_A_CONTROL_NSSSTS_HIGH_VALUE << SI32_SPI_A_CONTROL_NSSSTS_SHIFT)

#define SI32_SPI_A_CONTROL_BUSYF_MASK  0x00008000
#define SI32_SPI_A_CONTROL_BUSYF_SHIFT  15
// The SPI is not busy and a transfer is not in progress.
#define SI32_SPI_A_CONTROL_BUSYF_NOT_SET_VALUE  0
#define SI32_SPI_A_CONTROL_BUSYF_NOT_SET_U32 \
   (SI32_SPI_A_CONTROL_BUSYF_NOT_SET_VALUE << SI32_SPI_A_CONTROL_BUSYF_SHIFT)
// The SPI is currently busy and a transfer is in progress.
#define SI32_SPI_A_CONTROL_BUSYF_SET_VALUE  1
#define SI32_SPI_A_CONTROL_BUSYF_SET_U32 \
   (SI32_SPI_A_CONTROL_BUSYF_SET_VALUE << SI32_SPI_A_CONTROL_BUSYF_SHIFT)

#define SI32_SPI_A_CONTROL_RFCNT_MASK  0x000F0000
#define SI32_SPI_A_CONTROL_RFCNT_SHIFT  16

#define SI32_SPI_A_CONTROL_TFCNT_MASK  0x00F00000
#define SI32_SPI_A_CONTROL_TFCNT_SHIFT  20

#define SI32_SPI_A_CONTROL_DBGMD_MASK  0x01000000
#define SI32_SPI_A_CONTROL_DBGMD_SHIFT  24
// The SPI module will continue to operate while the core is halted in debug mode.
#define SI32_SPI_A_CONTROL_DBGMD_RUN_VALUE  0
#define SI32_SPI_A_CONTROL_DBGMD_RUN_U32 \
   (SI32_SPI_A_CONTROL_DBGMD_RUN_VALUE << SI32_SPI_A_CONTROL_DBGMD_SHIFT)
// A debug breakpoint will cause the SPI module to halt.
#define SI32_SPI_A_CONTROL_DBGMD_HALT_VALUE  1
#define SI32_SPI_A_CONTROL_DBGMD_HALT_U32 \
   (SI32_SPI_A_CONTROL_DBGMD_HALT_VALUE << SI32_SPI_A_CONTROL_DBGMD_SHIFT)



struct SI32_SPI_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // Receive FIFO Read Request Interrupt Enable
         volatile uint32_t RFRQIEN: 1;
         // Receive FIFO Overrun Interrupt Enable
         volatile uint32_t RFORIEN: 1;
         // Transmit FIFO Write Request Interrupt Enable
         volatile uint32_t TFRQIEN: 1;
         // Transmit FIFO Overrun Interrupt Enable
         volatile uint32_t TFORIEN: 1;
         // Slave Selected Interrupt Enable
         volatile uint32_t SLVSELIEN: 1;
         // Mode Fault Interrupt Enable
         volatile uint32_t MDFIEN: 1;
         // Underrun Interrupt Enable
         volatile uint32_t URIEN: 1;
         // Shift Register Empty Interrupt Enable
         volatile uint32_t SREIEN: 1;
         // SPI Enable
         volatile uint32_t SPIEN: 1;
         // Master Mode Enable
         volatile uint32_t MSTEN: 1;
         // SPI Clock Polarity
         volatile uint32_t CLKPOL: 1;
         // SPI Clock Phase
         volatile uint32_t CLKPHA: 1;
         // Slave Select Polarity Select
         volatile uint32_t NSSPOL: 1;
         // Data Direction Select
         volatile uint32_t DDIRSEL: 1;
         // Slave Select Mode
         volatile uint32_t NSSMD: 2;
         // Receive FIFO Threshold
         volatile uint32_t RFTH: 2;
         // Transmit FIFO Threshold
         volatile uint32_t TFTH: 2;
         // Data Size
         volatile uint32_t DSIZE: 4;
         // DMA Enable
         volatile uint32_t DMAEN: 1;
                  uint32_t reserved0: 4;
         // Receive FIFO Flush
         volatile uint32_t RFIFOFL: 1;
         // Transmit FIFO Flush
         volatile uint32_t TFIFOFL: 1;
         // Module Soft Reset
         volatile uint32_t RESET: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SPI_A_CONFIG_RFRQIEN_MASK  0x00000001
#define SI32_SPI_A_CONFIG_RFRQIEN_SHIFT  0
// Disable the receive FIFO request interrupt.
#define SI32_SPI_A_CONFIG_RFRQIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_RFRQIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_RFRQIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_RFRQIEN_SHIFT)
// Enable the receive FIFO request interrupt.
#define SI32_SPI_A_CONFIG_RFRQIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_RFRQIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_RFRQIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_RFRQIEN_SHIFT)

#define SI32_SPI_A_CONFIG_RFORIEN_MASK  0x00000002
#define SI32_SPI_A_CONFIG_RFORIEN_SHIFT  1
// Disable the receive FIFO overrun interrupt.
#define SI32_SPI_A_CONFIG_RFORIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_RFORIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_RFORIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_RFORIEN_SHIFT)
// Enable the receive FIFO overrun interrupt.
#define SI32_SPI_A_CONFIG_RFORIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_RFORIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_RFORIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_RFORIEN_SHIFT)

