jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SPI_A_Registers.h
#define SI32_SPI_A_CONFIG_TFRQIEN_MASK  0x00000004
#define SI32_SPI_A_CONFIG_TFRQIEN_SHIFT  2
// Disable the transmit FIFO data request interrupt.
#define SI32_SPI_A_CONFIG_TFRQIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_TFRQIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_TFRQIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_TFRQIEN_SHIFT)
// Enable the transmit FIFO data request interrupt.
#define SI32_SPI_A_CONFIG_TFRQIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_TFRQIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_TFRQIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_TFRQIEN_SHIFT)

#define SI32_SPI_A_CONFIG_TFORIEN_MASK  0x00000008
#define SI32_SPI_A_CONFIG_TFORIEN_SHIFT  3
// Disable the transmit FIFO overrun interrupt.
#define SI32_SPI_A_CONFIG_TFORIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_TFORIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_TFORIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_TFORIEN_SHIFT)
// Enable the transmit FIFO overrun interrupt.
#define SI32_SPI_A_CONFIG_TFORIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_TFORIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_TFORIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_TFORIEN_SHIFT)

#define SI32_SPI_A_CONFIG_SLVSELIEN_MASK  0x00000010
#define SI32_SPI_A_CONFIG_SLVSELIEN_SHIFT  4
// Disable the slave select interrupt.
#define SI32_SPI_A_CONFIG_SLVSELIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_SLVSELIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_SLVSELIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_SLVSELIEN_SHIFT)
// Enable the slave select interrupt.
#define SI32_SPI_A_CONFIG_SLVSELIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_SLVSELIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_SLVSELIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_SLVSELIEN_SHIFT)

#define SI32_SPI_A_CONFIG_MDFIEN_MASK  0x00000020
#define SI32_SPI_A_CONFIG_MDFIEN_SHIFT  5
// Disable the mode fault interrupt.
#define SI32_SPI_A_CONFIG_MDFIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_MDFIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_MDFIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_MDFIEN_SHIFT)
// Enable the mode fault interrupt.
#define SI32_SPI_A_CONFIG_MDFIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_MDFIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_MDFIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_MDFIEN_SHIFT)

#define SI32_SPI_A_CONFIG_URIEN_MASK  0x00000040
#define SI32_SPI_A_CONFIG_URIEN_SHIFT  6
// Disable the underrun interrupt.
#define SI32_SPI_A_CONFIG_URIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_URIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_URIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_URIEN_SHIFT)
// Enable the underrun interrupt.
#define SI32_SPI_A_CONFIG_URIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_URIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_URIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_URIEN_SHIFT)

#define SI32_SPI_A_CONFIG_SREIEN_MASK  0x00000080
#define SI32_SPI_A_CONFIG_SREIEN_SHIFT  7
// Disable the shift register empty interrupt.
#define SI32_SPI_A_CONFIG_SREIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_SREIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_SREIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_SREIEN_SHIFT)
// Enable the shift register empty interrupt.
#define SI32_SPI_A_CONFIG_SREIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_SREIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_SREIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_SREIEN_SHIFT)

#define SI32_SPI_A_CONFIG_SPIEN_MASK  0x00000100
#define SI32_SPI_A_CONFIG_SPIEN_SHIFT  8
// Disable the SPI.
#define SI32_SPI_A_CONFIG_SPIEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_SPIEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_SPIEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_SPIEN_SHIFT)
// Enable the SPI.
#define SI32_SPI_A_CONFIG_SPIEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_SPIEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_SPIEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_SPIEN_SHIFT)

#define SI32_SPI_A_CONFIG_MSTEN_MASK  0x00000200
#define SI32_SPI_A_CONFIG_MSTEN_SHIFT  9
// Operate in slave mode.
#define SI32_SPI_A_CONFIG_MSTEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_MSTEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_MSTEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_MSTEN_SHIFT)
// Operate in master mode.
#define SI32_SPI_A_CONFIG_MSTEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_MSTEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_MSTEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_MSTEN_SHIFT)

#define SI32_SPI_A_CONFIG_CLKPOL_MASK  0x00000400
#define SI32_SPI_A_CONFIG_CLKPOL_SHIFT  10
// The SCK line is low in the idle state.
#define SI32_SPI_A_CONFIG_CLKPOL_LOW_VALUE  0
#define SI32_SPI_A_CONFIG_CLKPOL_LOW_U32 \
   (SI32_SPI_A_CONFIG_CLKPOL_LOW_VALUE << SI32_SPI_A_CONFIG_CLKPOL_SHIFT)
// The SCK line is high in the idle state.
#define SI32_SPI_A_CONFIG_CLKPOL_HIGH_VALUE  1
#define SI32_SPI_A_CONFIG_CLKPOL_HIGH_U32 \
   (SI32_SPI_A_CONFIG_CLKPOL_HIGH_VALUE << SI32_SPI_A_CONFIG_CLKPOL_SHIFT)

#define SI32_SPI_A_CONFIG_CLKPHA_MASK  0x00000800
#define SI32_SPI_A_CONFIG_CLKPHA_SHIFT  11
// The first edge of SCK is the sample edge (center of data bit).
#define SI32_SPI_A_CONFIG_CLKPHA_CENTER_VALUE  0
#define SI32_SPI_A_CONFIG_CLKPHA_CENTER_U32 \
   (SI32_SPI_A_CONFIG_CLKPHA_CENTER_VALUE << SI32_SPI_A_CONFIG_CLKPHA_SHIFT)
// The first edge of SCK is the shift edge (edge of data bit).
#define SI32_SPI_A_CONFIG_CLKPHA_EDGE_VALUE  1
#define SI32_SPI_A_CONFIG_CLKPHA_EDGE_U32 \
   (SI32_SPI_A_CONFIG_CLKPHA_EDGE_VALUE << SI32_SPI_A_CONFIG_CLKPHA_SHIFT)

#define SI32_SPI_A_CONFIG_NSSPOL_MASK  0x00001000
#define SI32_SPI_A_CONFIG_NSSPOL_SHIFT  12
// NSS is active low.
#define SI32_SPI_A_CONFIG_NSSPOL_LOW_VALUE  0
#define SI32_SPI_A_CONFIG_NSSPOL_LOW_U32 \
   (SI32_SPI_A_CONFIG_NSSPOL_LOW_VALUE << SI32_SPI_A_CONFIG_NSSPOL_SHIFT)
// NSS is active high.
#define SI32_SPI_A_CONFIG_NSSPOL_HIGH_VALUE  1
#define SI32_SPI_A_CONFIG_NSSPOL_HIGH_U32 \
   (SI32_SPI_A_CONFIG_NSSPOL_HIGH_VALUE << SI32_SPI_A_CONFIG_NSSPOL_SHIFT)

#define SI32_SPI_A_CONFIG_DDIRSEL_MASK  0x00002000
#define SI32_SPI_A_CONFIG_DDIRSEL_SHIFT  13
// Data will be shifted MSB first.
#define SI32_SPI_A_CONFIG_DDIRSEL_MSB_FIRST_VALUE  0
#define SI32_SPI_A_CONFIG_DDIRSEL_MSB_FIRST_U32 \
   (SI32_SPI_A_CONFIG_DDIRSEL_MSB_FIRST_VALUE << SI32_SPI_A_CONFIG_DDIRSEL_SHIFT)
// Data will be shifted LSB first.
#define SI32_SPI_A_CONFIG_DDIRSEL_LSB_FIRST_VALUE  1
#define SI32_SPI_A_CONFIG_DDIRSEL_LSB_FIRST_U32 \
   (SI32_SPI_A_CONFIG_DDIRSEL_LSB_FIRST_VALUE << SI32_SPI_A_CONFIG_DDIRSEL_SHIFT)

#define SI32_SPI_A_CONFIG_NSSMD_MASK  0x0000C000
#define SI32_SPI_A_CONFIG_NSSMD_SHIFT  14
// 3-wire Slave or 3-wire Master.
#define SI32_SPI_A_CONFIG_NSSMD_3_WIRE_MASTER_SLAVE_VALUE  0
#define SI32_SPI_A_CONFIG_NSSMD_3_WIRE_MASTER_SLAVE_U32 \
   (SI32_SPI_A_CONFIG_NSSMD_3_WIRE_MASTER_SLAVE_VALUE << SI32_SPI_A_CONFIG_NSSMD_SHIFT)
// 4-wire slave (NSS input).  This setting can also be used for multi-master
// configurations.
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_SLAVE_VALUE  1
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_SLAVE_U32 \
   (SI32_SPI_A_CONFIG_NSSMD_4_WIRE_SLAVE_VALUE << SI32_SPI_A_CONFIG_NSSMD_SHIFT)
// 4-wire master with NSS low (NSS output).
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_LOW_VALUE  2
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_LOW_U32 \
   (SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_LOW_VALUE << SI32_SPI_A_CONFIG_NSSMD_SHIFT)
// 4-wire master with NSS high (NSS output).
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_HIGH_VALUE  3
#define SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_HIGH_U32 \
   (SI32_SPI_A_CONFIG_NSSMD_4_WIRE_MASTER_NSS_HIGH_VALUE << SI32_SPI_A_CONFIG_NSSMD_SHIFT)

