jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SPI_A_Registers.h
#define SI32_SPI_A_CONFIG_RFTH_MASK  0x00030000
#define SI32_SPI_A_CONFIG_RFTH_SHIFT  16
// A DMA / RFRQ request asserts when >= 1 FIFO slot is filled.
#define SI32_SPI_A_CONFIG_RFTH_ONE_VALUE  0
#define SI32_SPI_A_CONFIG_RFTH_ONE_U32 \
   (SI32_SPI_A_CONFIG_RFTH_ONE_VALUE << SI32_SPI_A_CONFIG_RFTH_SHIFT)
// A DMA / RFRQ request asserts when >= 2 FIFO slots are filled.
#define SI32_SPI_A_CONFIG_RFTH_TWO_VALUE  1
#define SI32_SPI_A_CONFIG_RFTH_TWO_U32 \
   (SI32_SPI_A_CONFIG_RFTH_TWO_VALUE << SI32_SPI_A_CONFIG_RFTH_SHIFT)
// A DMA / RFRQ request asserts when >= 4 FIFO slots are filled.
#define SI32_SPI_A_CONFIG_RFTH_FOUR_VALUE  2
#define SI32_SPI_A_CONFIG_RFTH_FOUR_U32 \
   (SI32_SPI_A_CONFIG_RFTH_FOUR_VALUE << SI32_SPI_A_CONFIG_RFTH_SHIFT)
// A DMA / RFRQ request asserts when all FIFO slots are filled.
#define SI32_SPI_A_CONFIG_RFTH_FULL_VALUE  3
#define SI32_SPI_A_CONFIG_RFTH_FULL_U32 \
   (SI32_SPI_A_CONFIG_RFTH_FULL_VALUE << SI32_SPI_A_CONFIG_RFTH_SHIFT)

#define SI32_SPI_A_CONFIG_TFTH_MASK  0x000C0000
#define SI32_SPI_A_CONFIG_TFTH_SHIFT  18
// A DMA / TFRQ request asserts when >= 1 FIFO slot is empty.
#define SI32_SPI_A_CONFIG_TFTH_ONE_VALUE  0
#define SI32_SPI_A_CONFIG_TFTH_ONE_U32 \
   (SI32_SPI_A_CONFIG_TFTH_ONE_VALUE << SI32_SPI_A_CONFIG_TFTH_SHIFT)
// A DMA / TFRQ request asserts when >=2 FIFO slots are empty.
#define SI32_SPI_A_CONFIG_TFTH_TWO_VALUE  1
#define SI32_SPI_A_CONFIG_TFTH_TWO_U32 \
   (SI32_SPI_A_CONFIG_TFTH_TWO_VALUE << SI32_SPI_A_CONFIG_TFTH_SHIFT)
// A DMA / TFRQ request asserts when >= 4 FIFO slots are empty.
#define SI32_SPI_A_CONFIG_TFTH_FOUR_VALUE  2
#define SI32_SPI_A_CONFIG_TFTH_FOUR_U32 \
   (SI32_SPI_A_CONFIG_TFTH_FOUR_VALUE << SI32_SPI_A_CONFIG_TFTH_SHIFT)
// A DMA / TFRQ request asserts when all FIFO slots are empty.
#define SI32_SPI_A_CONFIG_TFTH_EMPTY_VALUE  3
#define SI32_SPI_A_CONFIG_TFTH_EMPTY_U32 \
   (SI32_SPI_A_CONFIG_TFTH_EMPTY_VALUE << SI32_SPI_A_CONFIG_TFTH_SHIFT)

#define SI32_SPI_A_CONFIG_DSIZE_MASK  0x00F00000
#define SI32_SPI_A_CONFIG_DSIZE_SHIFT  20

#define SI32_SPI_A_CONFIG_DMAEN_MASK  0x01000000
#define SI32_SPI_A_CONFIG_DMAEN_SHIFT  24
// Disable DMA requests.
#define SI32_SPI_A_CONFIG_DMAEN_DISABLED_VALUE  0
#define SI32_SPI_A_CONFIG_DMAEN_DISABLED_U32 \
   (SI32_SPI_A_CONFIG_DMAEN_DISABLED_VALUE << SI32_SPI_A_CONFIG_DMAEN_SHIFT)
// Enable DMA requests when the transmit buffer is empty or the receive buffer is
// full.
#define SI32_SPI_A_CONFIG_DMAEN_ENABLED_VALUE  1
#define SI32_SPI_A_CONFIG_DMAEN_ENABLED_U32 \
   (SI32_SPI_A_CONFIG_DMAEN_ENABLED_VALUE << SI32_SPI_A_CONFIG_DMAEN_SHIFT)

#define SI32_SPI_A_CONFIG_RFIFOFL_MASK  0x20000000
#define SI32_SPI_A_CONFIG_RFIFOFL_SHIFT  29
// Flush the receive FIFO.
#define SI32_SPI_A_CONFIG_RFIFOFL_SET_VALUE  1
#define SI32_SPI_A_CONFIG_RFIFOFL_SET_U32 \
   (SI32_SPI_A_CONFIG_RFIFOFL_SET_VALUE << SI32_SPI_A_CONFIG_RFIFOFL_SHIFT)

#define SI32_SPI_A_CONFIG_TFIFOFL_MASK  0x40000000
#define SI32_SPI_A_CONFIG_TFIFOFL_SHIFT  30
// Flush the transmit FIFO.
#define SI32_SPI_A_CONFIG_TFIFOFL_SET_VALUE  1
#define SI32_SPI_A_CONFIG_TFIFOFL_SET_U32 \
   (SI32_SPI_A_CONFIG_TFIFOFL_SET_VALUE << SI32_SPI_A_CONFIG_TFIFOFL_SHIFT)

#define SI32_SPI_A_CONFIG_RESET_MASK  0x80000000
#define SI32_SPI_A_CONFIG_RESET_SHIFT  31
// SPI module is not in soft reset.
#define SI32_SPI_A_CONFIG_RESET_INACTIVE_VALUE  0U
#define SI32_SPI_A_CONFIG_RESET_INACTIVE_U32 \
   (SI32_SPI_A_CONFIG_RESET_INACTIVE_VALUE << SI32_SPI_A_CONFIG_RESET_SHIFT)
// SPI module is in soft reset and some of the module bits cannot be accessed until
// this bit is cleared to 0 by hardware.
#define SI32_SPI_A_CONFIG_RESET_ACTIVE_VALUE  1U
#define SI32_SPI_A_CONFIG_RESET_ACTIVE_U32 \
   (SI32_SPI_A_CONFIG_RESET_ACTIVE_VALUE << SI32_SPI_A_CONFIG_RESET_SHIFT)



struct SI32_SPI_A_CLKRATE_Struct
{
   union
   {
      struct
      {
         // Clock Divider
         volatile uint16_t CLKDIV;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SPI_A_CLKRATE_CLKDIV_MASK  0x0000FFFF
#define SI32_SPI_A_CLKRATE_CLKDIV_SHIFT  0



struct SI32_SPI_A_FSTATUS_Struct
{
   union
   {
      struct
      {
         // Receive FIFO Read Pointer
         volatile uint32_t RFRPTR: 4;
         // Receive FIFO Write Pointer
         volatile uint32_t RFWPTR: 4;
         // Transmit FIFO Read Pointer
         volatile uint32_t TFRPTR: 4;
         // Transmit FIFO Write Pointer
         volatile uint32_t TFWPTR: 4;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SPI_A_FSTATUS_RFRPTR_MASK  0x0000000F
#define SI32_SPI_A_FSTATUS_RFRPTR_SHIFT  0

#define SI32_SPI_A_FSTATUS_RFWPTR_MASK  0x000000F0
#define SI32_SPI_A_FSTATUS_RFWPTR_SHIFT  4

#define SI32_SPI_A_FSTATUS_TFRPTR_MASK  0x00000F00
#define SI32_SPI_A_FSTATUS_TFRPTR_SHIFT  8

#define SI32_SPI_A_FSTATUS_TFWPTR_MASK  0x0000F000
#define SI32_SPI_A_FSTATUS_TFWPTR_SHIFT  12



typedef struct SI32_SPI_A_Struct
{
   struct SI32_SPI_A_DATA_Struct                   DATA           ; // Base Address + 0x0
   uint32_t                                        reserved0;
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   struct SI32_SPI_A_CONTROL_Struct                CONTROL        ; // Base Address + 0x10
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved3;
   struct SI32_SPI_A_CONFIG_Struct                 CONFIG         ; // Base Address + 0x20
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved4;
   struct SI32_SPI_A_CLKRATE_Struct                CLKRATE        ; // Base Address + 0x30
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   struct SI32_SPI_A_FSTATUS_Struct                FSTATUS        ; // Base Address + 0x40
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   uint32_t                                        reserved10;
} SI32_SPI_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_SPI_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

